Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Math/src/Ifx_Math_Pi_F16.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_Math_Pi_F16.h"
#include "Ifx_Math_MulShR.h"
#include "Ifx_Math_Sub.h"
#include "Ifx_Math_Add.h"
#include "Ifx_Math_Sat.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* Additional shift factor for the PI internal Q format which is a trade-off between range and resolution */
#define IFX_MATH_PI_F16_INT_Q_SHIFT           Ifx_Math_FractQFormat_q9

/* If the trapezoidal method is chosen, divide sampling time by 2 */
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_TRAPEZOIDAL
#define IFX_MATH_PI_F16_SAMPLING_TIME_DIVIDER (1)
#else
#define IFX_MATH_PI_F16_SAMPLING_TIME_DIVIDER (0)
#endif

/******************************************************************************/
/*-----------------------Private Function Prototypes--------------------------*/
/******************************************************************************/

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_TRAPEZOIDAL
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC

/**
 *  \brief PI controller implementation using trapezoidal discretization and anti-windup back calculation
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                             errorValue);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP

/**
 *  \brief PI controller implementation using trapezoidal discretization and anti-windup clamp
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *  \param [in] antiWindupCtrl Antiwindup control input
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                                   Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE

/**
 *  \brief PI controller implementation using trapezoidal discretization and no anti-windup
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue);

#endif

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_FORWARD
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC

/**
 *  \brief PI controller implementation using Forward Euler discretization and anti-windup back calculation
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                              errorValue);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP

/**
 *  \brief PI controller implementation using Forward Euler discretization and anti-windup clamp
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *  \param [in] antiWindupCtrl Antiwindup control input
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                    errorValue, Ifx_Math_Pi_F16_AntiWindupCtrl
                                                                    antiWindupCtrl);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE

/**
 *  \brief PI controller implementation using Forward Euler discretization and no anti-windup
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue);

#endif

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_BACKWARD
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC

/**
 *  \brief PI controller implementation using Backward Euler discretization and anti-windup back calculation
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                           errorValue);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP

/**
 *  \brief PI controller implementation using Backward Euler discretization and anti-windup clamp
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *  \param [in] antiWindupCtrl Antiwindup control input
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                                 Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl);

#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE

/**
 *  \brief PI controller implementation using Backward Euler discretization and no anti-windup
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Input error
 *
 *  \return PI controller output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue);

#endif

#endif

/**
 *  \brief Saturate the integral gain previous value between the defined limits
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *
 */
static inline void Ifx_Math_Pi_F16_p_saturatePreviousValue(Ifx_Math_Pi_F16* self);

/**
 *  \brief Saturate the output between the defined limits
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] out Output of the PI to be saturated
 *
 *  \return Saturated output
 */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_saturateOutput(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 out);

/**
 *  \brief Calculate the product between the error and the gain and return the intermediate Q format
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Error input to the PI controller
 *  \param [inout] propGainError Proportional gain multiplied by the input error
 *  \param [inout] integGainError Integral gain multiplied by the sampliing time and input error
 *
 */
static inline void Ifx_Math_Pi_F16_p_calculateGainsError(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                         Ifx_Math_Fract32* propGainError,
                                                         Ifx_Math_Fract32* integGainError);

/**
 *  \brief Check whether integration should be enabled or disabled based on internal and external antiWindup flags
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Error input to the PI controller
 *  \param [in] antiWindupCtrl Antiwindup control input
 *
 * \return Signed integer with value 1 if integration is enabled and 0 if integration is disabled
 */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupControl(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                         Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl);

/**
 *  \brief Check whether integration should be enabled or disabled based on an internal antiWindup flag
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Error input to the PI controller
 *
 * \return Signed integer with value 1 if integration is enabled and 0 if integration is disabled
 */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupCtrlIntern(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue);

/**
 *  \brief Check whether integration should be enabled or disabled based on an external antiWindup flag
 *
 *
 *  \param [in] errorValue Error input to the PI controller
 *  \param [in] antiWindupCtrl Antiwindup control input
 *
 * \return Signed integer with value 1 if integration is enabled and 0 if integration is disabled
 */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupCtrlExtern(Ifx_Math_Fract16               errorValue,
                                                            Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl);
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC

/**
 *
 *  \param [inout] self Reference to structure that contains instance data members
 *  \param [in] errorValue Calculate the antiwindup part using the back calculation method
 *
 *  \return
 */
static inline Ifx_Math_Fract32 Ifx_Math_Pi_F16_p_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract32 errorValue);
#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC */
/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
void Ifx_Math_Pi_F16_init(Ifx_Math_Pi_F16* self, Ifx_Math_Pi_F16_Qformats qformatsPi)
{
    /* Initialize limits to maximum */
    self->p_upperLimit = IFX_MATH_FRACT16_MAX;
    self->p_lowerLimit = IFX_MATH_FRACT16_MIN;

    /* Initialize integral previous value to 0 and saturation status to no */
    self->p_integPreviousValue = 0;
    self->p_saturationStatus   = Ifx_Math_Pi_F16_AntiWindupCtrl_no;

    /* Initialize qformat of error and the output */
    self->p_qFormatError  = qformatsPi.qFormatError;
    self->p_qFormatOutput = qformatsPi.qFormatOutput;

    /* Init. gains to default values */
    Ifx_Math_Fract16Q defaultGain = {
        .value = IFX_MATH_FRACT16_MAX, .qFormat = Ifx_Math_FractQFormat_q15
    };
    Ifx_Math_Pi_F16_setPropGain(self, defaultGain);
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(self, defaultGain);
    Ifx_Math_Pi_F16_setAntiWindupGainSamplingTime(self, defaultGain);
}


Ifx_Math_Fract16 Ifx_Math_Pi_F16_execute(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                         Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl)
{
    Ifx_Math_Fract16 result;

    /* Implements a trapezoidal discretization of the integrator */
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_TRAPEZOIDAL

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
    result = Ifx_Math_Pi_F16_p_trapezoidal_backCalculation(self, errorValue);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
    result = Ifx_Math_Pi_F16_p_trapezoidal_clamp(self, errorValue, antiWindupCtrl);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE
    result = Ifx_Math_Pi_F16_p_trapezoidal(self, errorValue);
#endif

