Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Math/src/Ifx_Math_Pi_F16.c
    /* Implements a Forward Euler discretization of the integrator */
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_FORWARD

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
    result = Ifx_Math_Pi_F16_p_forwardEuler_backCalculation(self, errorValue);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
    result = Ifx_Math_Pi_F16_p_forwardEuler_clamp(self, errorValue, antiWindupCtrl);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE
    result = Ifx_Math_Pi_F16_p_forwardEuler(self, errorValue);
#endif

    /* Implements a Backward Euler discretization of the integrator */
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_BACKWARD

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
    result = Ifx_Math_Pi_F16_p_backEuler_backCalculation(self, errorValue);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
    result = Ifx_Math_Pi_F16_p_backEuler_clamp(self, errorValue, antiWindupCtrl);
#elif IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE
    result = Ifx_Math_Pi_F16_p_backEuler(self, errorValue);
#endif

#endif

    return result;
}


void Ifx_Math_Pi_F16_setPropGain(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16Q propGain)
{
    /* Update internal parameter */
    self->p_propGain = propGain;

    /* Update internal Q formats */
    uint8_t tempQFormat = (uint8_t)self->p_qFormatOutput + (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT;
    self->p_propGainInternQFormat = Ifx_Math_MulShR_ShiftMul(self->p_propGain.qFormat, self->p_qFormatError,
        (Ifx_Math_FractQFormat)tempQFormat);
}


void Ifx_Math_Pi_F16_setIntegGainSamplingTime(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16Q integGainSamplingTime)
{
    /* Update internal parameter */
    self->p_integGainSamplingTime = integGainSamplingTime;

    /* Update internal Q formats */
    uint8_t tempQFormat = (uint8_t)self->p_qFormatOutput + (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT;
    self->p_integGainInternQFormat = Ifx_Math_MulShR_ShiftMul(self->p_integGainSamplingTime.qFormat,
        self->p_qFormatError, (Ifx_Math_FractQFormat)tempQFormat) + IFX_MATH_PI_F16_SAMPLING_TIME_DIVIDER;
}


void Ifx_Math_Pi_F16_setAntiWindupGainSamplingTime(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16Q
                                                   antiWindupGainSamplingTime)
{
    /* Update internal parameter */
    self->p_antiWindupGainSamplingTime = antiWindupGainSamplingTime;

    /* Update internal Q formats */
    uint8_t tempQFormat = (uint8_t)self->p_qFormatOutput + (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT;
    self->p_antiWindupGainInternQFormat = Ifx_Math_MulShR_ShiftMul(self->p_antiWindupGainSamplingTime.qFormat,
        (Ifx_Math_FractQFormat)tempQFormat, (Ifx_Math_FractQFormat)tempQFormat) +
                                          IFX_MATH_PI_F16_SAMPLING_TIME_DIVIDER;
}


/* Saturate the integral gain previous value between the defined limits */
static inline void Ifx_Math_Pi_F16_p_saturatePreviousValue(Ifx_Math_Pi_F16* self)
{
    /* Previous value */
    Ifx_Math_Fract32 previousValueTemp;

    /* Upper limit for the previous value, in the intermediate Q format */
    Ifx_Math_Fract32 previousValueTempUpp;

    /* Lower limit for the previous value, in the intermediate Q format */
    Ifx_Math_Fract32 previousValueTempLow;

    /* Read previous value */
    previousValueTemp = self->p_integPreviousValue;

    /* Previous value saturation */
    previousValueTempUpp = Ifx_Math_ShL_F32(self->p_upperLimit, (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT);
    previousValueTempLow = Ifx_Math_ShL_F32(self->p_lowerLimit, (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT);

    if (previousValueTemp > previousValueTempUpp)
    {
        self->p_integPreviousValue = previousValueTempUpp;
    }
    else if (previousValueTemp < previousValueTempLow)
    {
        self->p_integPreviousValue = previousValueTempLow;
    }
    else
    {
        self->p_integPreviousValue = previousValueTemp;
    }
}


/* Saturate the output between the defined limits */
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_saturateOutput(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 out)
{
    Ifx_Math_Fract16 outSat;

    if (out >= self->p_upperLimit)
    {
        outSat                   = self->p_upperLimit;
        self->p_saturationStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_pos;
    }
    else if (out <= self->p_lowerLimit)
    {
        outSat                   = self->p_lowerLimit;
        self->p_saturationStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_neg;
    }
    else
    {
        outSat                   = out;
        self->p_saturationStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
    }

    return outSat;
}


/* Calculate the product between the error and the gain and return the intermediate Q format */
static inline void Ifx_Math_Pi_F16_p_calculateGainsError(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                         Ifx_Math_Fract32* propGainError,
                                                         Ifx_Math_Fract32* integGainError)
{
    /* Calculate proportional part (U_p) */
    *propGainError = Ifx_Math_MulShR_F32_F16F16(self->p_propGain.value, errorValue, self->p_propGainInternQFormat);

    /* Calculate integral part (U_i) */
    *integGainError = Ifx_Math_MulShR_F32_F16F16(self->p_integGainSamplingTime.value, errorValue,
        self->p_integGainInternQFormat);
}


/* Check internal antiwindup conditions */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupCtrlIntern(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue)
{
    int8_t antiWindupCtrlIntern = 0;

    if ((Ifx_Math_Pi_F16_AntiWindupCtrl_no == self->p_saturationStatus)
        || ((0 > errorValue)
            && (Ifx_Math_Pi_F16_AntiWindupCtrl_pos == self->p_saturationStatus))
        || ((0 < errorValue)
            && (Ifx_Math_Pi_F16_AntiWindupCtrl_neg == self->p_saturationStatus)))
    {
        antiWindupCtrlIntern = 1;
    }

    return antiWindupCtrlIntern;
}


/* Check external antiwindup conditions */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupCtrlExtern(Ifx_Math_Fract16               errorValue,
                                                            Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl)
{
    int8_t antiWindupCtrlExtern = 0;

    /* Check external antiwindup control */
    if (((Ifx_Math_Pi_F16_AntiWindupCtrl_no == antiWindupCtrl)
         || ((0 > errorValue)
             && (Ifx_Math_Pi_F16_AntiWindupCtrl_pos == antiWindupCtrl))
         || ((0 < errorValue)
             && (Ifx_Math_Pi_F16_AntiWindupCtrl_neg == antiWindupCtrl))))
    {
        antiWindupCtrlExtern = 1;
    }

