Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Math/src/Ifx_Math_Pi_F16.c
    return antiWindupCtrlExtern;
}


/* Check internal and external antiwindup conditions */
static inline int8_t Ifx_Math_Pi_F16_p_antiWindupControl(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                         Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl)
{
    /* Internal variable */
    int8_t antiWindupSwitch;
    int8_t antiWindupCtrlExtern = Ifx_Math_Pi_F16_p_antiWindupCtrlExtern(errorValue, antiWindupCtrl);
    int8_t antiWindupCtrlintern = Ifx_Math_Pi_F16_p_antiWindupCtrlIntern(self, errorValue);
    antiWindupSwitch = antiWindupCtrlExtern * antiWindupCtrlintern;

    return antiWindupSwitch;
}


#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC

/* Calculate the antiwindup part using the back calculation method */
static inline Ifx_Math_Fract32 Ifx_Math_Pi_F16_p_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract32 errorValue)
{
    /* Upper limit for the previous integral value */
    Ifx_Math_Fract32 integStateTempUpp;

    /* Lower limit for the previous integral value */
    Ifx_Math_Fract32 integStateTempLow;

    /* Anti windup coefficient */
    Ifx_Math_Fract32 coefficient;
    integStateTempUpp = Ifx_Math_ShL_F32(self->p_upperLimit, (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT);
    integStateTempLow = Ifx_Math_ShL_F32(self->p_lowerLimit, (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT);

    /* Back calculation */
    if (errorValue > integStateTempUpp)
    {
        /* Calculate anti-windup part (U_aw)  */
        coefficient = Ifx_Math_MulShR_F32(self->p_antiWindupGainSamplingTime.value, Ifx_Math_Sub_F32(
            integStateTempUpp, errorValue), self->p_antiWindupGainInternQFormat);
    }
    else if (errorValue < integStateTempLow)
    {
        /* Calculate anti-windup part (U_aw) */
        coefficient = Ifx_Math_MulShR_F32(self->p_antiWindupGainSamplingTime.value, Ifx_Math_Sub_F32(
            integStateTempLow, errorValue), self->p_antiWindupGainInternQFormat);
    }
    else
    {
        coefficient = 0;
    }

    return coefficient;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC */

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_TRAPEZOIDAL
#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue)
{
    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;

    /* (Integral gain * input error) + previous integral value */
    Ifx_Math_Fract32 integGainErrorPrevVal;

    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);
    integGainErrorPrevVal = Ifx_Math_Add_F32(integGainError, self->p_integPreviousValue);

    /* Calculate output (U) */
    out    = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, integGainErrorPrevVal),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    /* Update state */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError, integGainErrorPrevVal);

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_NONE */

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                                   Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Calculate output using regular Trapezoidal method */
    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* Calculate gains times error */
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Check antiwindup status */
    int8_t antiWindupSwitch = Ifx_Math_Pi_F16_p_antiWindupControl(self, errorValue, antiWindupCtrl);

    /* First half integration */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError * antiWindupSwitch, self->p_integPreviousValue);

    /* Saturate previous value after first half integration */
    Ifx_Math_Pi_F16_p_saturatePreviousValue(self);

    /* Calculate output (U) */
    out = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));

    /* Second half integration */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError * antiWindupSwitch, self->p_integPreviousValue);

    /* Saturate previous value after second half integration */
    Ifx_Math_Pi_F16_p_saturatePreviousValue(self);

    /* Saturate output */
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP */

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_trapezoidal_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                             errorValue)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;

    /* (Integral gain * input error) + previous integral value */
    Ifx_Math_Fract32 integGainErrorPrevVal;

    /* (Proportional gain * input error) + previous integral value */
    Ifx_Math_Fract32 propGainErrorPrevVal;

    /* Anti windup coefficient */
    Ifx_Math_Fract32 antiWindup;

    /* Q format for intermediate calculations */
    Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* (Proportional gain * input error) + previous integral value */
    propGainErrorPrevVal = Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue);

    /* Calculate anti windup coefficient */
    antiWindup            = Ifx_Math_Pi_F16_p_backCalculation(self, propGainErrorPrevVal);
    integGainErrorPrevVal = Ifx_Math_Add_F32(antiWindup, Ifx_Math_Add_F32(integGainError,
        self->p_integPreviousValue));

    /* Calculate output (U) */
    out    = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, integGainErrorPrevVal),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    /* Update state */
    self->p_integPreviousValue = Ifx_Math_Add_F32(Ifx_Math_Add_F32(antiWindup, integGainError),
        integGainErrorPrevVal);

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC */

#endif

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_FORWARD

static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Calculate output (U) */
    out    = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    /* Update state */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError, self->p_integPreviousValue);

    return outSat;
}


#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                    errorValue, Ifx_Math_Pi_F16_AntiWindupCtrl
                                                                    antiWindupCtrl)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Calculate output (U) */
    out = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));

    /* Saturate output */
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    /* Check antiwindup status */
    int8_t antiWindupSwitch = Ifx_Math_Pi_F16_p_antiWindupControl(self, errorValue, antiWindupCtrl);

