Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/example_uvision5/Math/src/Ifx_Math_Pi_F16.c
    /* Integrate */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError * antiWindupSwitch, self->p_integPreviousValue);

    /* Clamp integrator if it exceeds limit */
    Ifx_Math_Pi_F16_p_saturatePreviousValue(self);

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP */

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_forwardEuler_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                              errorValue)
{
    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;

    /* Anti windup coefficient */
    Ifx_Math_Fract32 antiWindup;

    /* Unsaturated output (32 bit) */
    Ifx_Math_Fract32 outF32;

    /* Unsaturated output (16 bit)*/
    Ifx_Math_Fract16 outF16;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* Q format for intermediate calculations */
    Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Calculate the first output, before back calculation */
    outF32 = Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue);

    /* Calculate anti windup coefficient using back calculation */
    antiWindup = Ifx_Math_Pi_F16_p_backCalculation(self, outF32);

    /* Calculate the unsaturated output */
    outF16 = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(outF32, (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, outF16);

    /* Update previous value */
    self->p_integPreviousValue = Ifx_Math_Add_F32(self->p_integPreviousValue, Ifx_Math_Add_F32(integGainError,
        antiWindup));

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC */

#endif

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_DISC == IFX_MATH_USROPT_PI_DISC_BACKWARD
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Update previous value */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError, self->p_integPreviousValue);

    /* Calculate output (U) */
    out    = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    return outSat;
}


#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler_clamp(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16 errorValue,
                                                                 Ifx_Math_Pi_F16_AntiWindupCtrl antiWindupCtrl)
{
    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* Saturated output */
    Ifx_Math_Fract16 outSat;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;
    (void)Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* Check antiwindup status */
    int8_t           antiWindupSwitch = Ifx_Math_Pi_F16_p_antiWindupControl(self, errorValue, antiWindupCtrl);

    /* Integrate */
    self->p_integPreviousValue = Ifx_Math_Add_F32(integGainError * antiWindupSwitch, self->p_integPreviousValue);

    /* Saturate state */
    Ifx_Math_Pi_F16_p_saturatePreviousValue(self);

    /* Calculate output (U) */
    out    = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));
    outSat = Ifx_Math_Pi_F16_p_saturateOutput(self, out);

    return outSat;
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_CLAMP */

#if IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC
static inline Ifx_Math_Fract16 Ifx_Math_Pi_F16_p_backEuler_backCalculation(Ifx_Math_Pi_F16* self, Ifx_Math_Fract16
                                                                           errorValue)
{
    /* (Proportional gain * input error) + previous integral value */
    Ifx_Math_Fract32 propGainErrorPrevVal;

    /* Unsaturated output */
    Ifx_Math_Fract16 out;

    /* (Proportional gain * input error) */
    Ifx_Math_Fract32 propGainError;

    /* (Integral gain * input error) */
    Ifx_Math_Fract32 integGainError;

    /* Anti windup coefficient */
    Ifx_Math_Fract32 antiWindup;

    /* Q format for intermediate calculations */
    Ifx_Math_Pi_F16_p_calculateGainsError(self, errorValue, &propGainError, &integGainError);

    /* (Proportional gain * input error) + previous value */
    propGainErrorPrevVal = Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue);

    /* Calculate anti windup coefficient using back calculation */
    antiWindup = Ifx_Math_Pi_F16_p_backCalculation(self, propGainErrorPrevVal);

    /* Update previous value */
    self->p_integPreviousValue = Ifx_Math_Add_F32(self->p_integPreviousValue, Ifx_Math_Add_F32(integGainError,
        antiWindup));

    /* Calculate output (U) */
    out = Ifx_Math_Sat_F16_F32(Ifx_Math_ShR_F32(Ifx_Math_Add_F32(propGainError, self->p_integPreviousValue),
        (uint8_t)IFX_MATH_PI_F16_INT_Q_SHIFT));

    return Ifx_Math_Pi_F16_p_saturateOutput(self, out);
}


#endif /* IFX_MATH_ADVANCEDMATH_F16_CFG_PI_ANTI_WIND == IFX_MATH_USROPT_PI_ANTI_WIND_BACK_CALC */

#endif
